; domain
(define (domain logistic_planning_1)
  (:requirements :strips :typing)

  (:types
    location - object ; can contain workstations robots and boxes
    workstation - object ; can get boxes and contain supplies
    robot - object ; can pick up boxes, fill them, unload them and move between locations
    box - object ; can contain supplies
    supply - object ; required by workstations
    valve - supply ; type of supply
    bolt - supply ; type of supply
    tool - supply ; type of supply
    )

  ;(:constants)

  (:predicates

    ;; locations
    (connected ?l1 ?l2 - location) ; location ?l1 is connected to location ?l2

    ;; boxes
    (box_at_loc ?b - box ?l - location) ; box ?b is in the location ?l
    (box_on_robot ?b - box ?r - robot) ; box ?b on robot ?r
    (box_empty ?b - box) ; box ?b is empty
    (box_full ?b - box) ; box ?b is full
    (supply_in_box ?s - supply ?b - box) ; supply ?s is in box ?b

    ;; robots
    (robot_at_loc ?r - robot ?l - location) ; robot ?r is at location ?l
    (robot_unloaded ?r - robot) ; robot ?r doesen't have a box
    (robot_loaded ?r - robot) ; robot ?r has a boxe

    ;; workstations
    (ws_at_loc ?w - workstation ?l - location) ; workstation ?w is at location ?l
    (ws_contains ?w - workstation ?s - supply) ; workstation ?w contains supply ?s
    (has_valve ?w - workstation) ; workstation ?w has a valve
    (has_bolt ?w - workstation) ; workstation ?w has a bolt
    (has_tool ?w - workstation) ; workstation ?w has a tool 
    
    ;; supplies
    (supply_available ?s - supply) ; supply ?s is available
    (supply_at_loc ?s - supply ?l - location) ; supply ?s is at location ?l
  )

  ;; loads an empty robot with a box
  (:action load_robot
    :parameters (?r - robot ?b - box ?l - location)
    :precondition (and
      (robot_at_loc ?r ?l)
      (robot_unloaded ?r)
      (box_at_loc ?b ?l)
    )
    :effect (and
      (not (robot_unloaded ?r))
      (robot_loaded ?r)
      (box_on_robot ?b ?r)
      (not (box_at_loc ?b ?l))
    )
  )

  ;; loads an empty box with a supply
  (:action load_supply
    :parameters (?r - robot ?l - location ?b - box ?s - supply)
    :precondition (and
      (robot_at_loc ?r ?l)
      (box_at_loc ?b ?l)
      (supply_at_loc ?s ?l)
      (box_empty ?b)
      (supply_available ?s)
    )
    :effect (and
      (supply_in_box ?s ?b)
      (not (box_empty ?b))
      (box_full ?b)
      (not (supply_at_loc ?s ?l))
    )
  )

  ;; moves a robot between two connected locations
  (:action move
    :parameters (?r - robot ?from ?to - location)
    :precondition (and
      (connected ?from ?to)
      (robot_at_loc ?r ?from)
      (robot_unloaded ?r)
    )
    :effect (and
      (robot_at_loc ?r ?to)
      (not (robot_at_loc ?r ?from))
    )
  )

  ;; moves a robot between two connected locations
  (:action move_box
    :parameters (?r - robot ?b - box ?from ?to - location)
    :precondition (and
      (connected ?from ?to)
      (robot_at_loc ?r ?from)
      (box_on_robot ?b ?r)
    )
    :effect (and
      (robot_at_loc ?r ?to)
      (not (robot_at_loc ?r ?from))
      (not (box_at_loc ?b ?from))
      (box_at_loc ?b ?to)
    )
  )

  ;; unloads the box from a robot
  (:action unload_robot
    :parameters (?r - robot ?b - box)
    :precondition (and
      (robot_loaded ?r)
      (box_on_robot ?b ?r)
    )
    :effect (and
      (not (robot_loaded ?r))
      (robot_unloaded ?r)
      (not (box_on_robot ?b ?r))
    )
  )

  ;; unloads the content of a box if it is a valve to a given workstation
  (:action unload_valve
    :parameters (?r - robot ?b - box ?valve - valve ?l - location ?w - workstation)
    :precondition (and
      (robot_at_loc ?r ?l)
      (supply_in_box ?valve ?b)
      (box_at_loc ?b ?l)
      (ws_at_loc ?w ?l)
      (box_full ?b)
      ;; (is_valve ?s)
    )
    :effect (and
      (box_empty ?b)
      (not (box_full ?b))
      (supply_at_loc ?valve ?l)
      (ws_contains ?w ?valve)
      (not (supply_in_box ?valve ?b))
      (not (supply_available ?valve))
      (has_valve ?w)
    )
  )

  ;; unloads the content of a box if it is a bolt to a given workstation
  (:action unload_bolt
    :parameters (?r - robot ?b - box ?bolt - bolt ?l - location ?w - workstation)
    :precondition (and
      (robot_at_loc ?r ?l)
      (supply_in_box ?bolt ?b)
      (box_at_loc ?b ?l)
      (ws_at_loc ?w ?l)
      (box_full ?b)
      ;; (is_bolt ?bolt)
    )
    :effect (and
      (box_empty ?b)
      (not (box_full ?b))
      (supply_at_loc ?bolt ?l)
      (ws_contains ?w ?bolt)
      (not (supply_in_box ?bolt ?b))
      (not (supply_available ?bolt))
      (has_bolt ?w)
    )
  )

  ;; unloads the content of a box if it is a tool to a given workstation
  (:action unload_tool
    :parameters (?r - robot ?b - box ?tool - tool ?l - location ?w - workstation)
    :precondition (and
      (robot_at_loc ?r ?l)
      (supply_in_box ?tool ?b)
      (box_at_loc ?b ?l)
      (ws_at_loc ?w ?l)
      (box_full ?b)
      ; (is_tool ?tool)
    )
    :effect (and
      (box_empty ?b)
      (not (box_full ?b))
      (supply_at_loc ?tool ?l)
      (ws_contains ?w ?tool)
      (not (supply_in_box ?tool ?b))
      (not (supply_available ?tool))
      (has_tool ?w)
    )
  )
)

; problem
(define (problem problem1_2)
  (:domain logistic_planning_1)

  (:objects
    cargo - robot
    warehouse_loc location1 location2 location3 - location
    workstation1 workstation2 workstation3 workstation4 - workstation
    box1 box2 box3 - box
    valve1 valve2 valve3 - valve
    bolt1 bolt2 bolt3 - bolt
    tool1 tool2 tool3 - tool
  )

  (:init
    ;; graph edges
    (connected warehouse_loc location1)
    (connected warehouse_loc location2)
    (connected warehouse_loc location3)
    (connected location1 warehouse_loc)
    (connected location1 location2)
    (connected location1 location3)
    (connected location2 warehouse_loc)
    (connected location2 location1)
    (connected location3 warehouse_loc)
    (connected location3 location1)
    ;; box location
    (box_at_loc box1 warehouse_loc)
    (box_at_loc box2 warehouse_loc)
    (box_at_loc box3 warehouse_loc)
    ;; box empty
    (box_empty box1)
    (box_empty box2)
    (box_empty box3)
    ;; robot location
    (robot_at_loc cargo warehouse_loc)
    ;; robot unloaded
    (robot_unloaded cargo)
    ;; workstation location
    (ws_at_loc workstation1 location1)
    (ws_at_loc workstation2 location1)
    (ws_at_loc workstation3 location2)
    (ws_at_loc workstation4 location3)
    ;; supplies location
    (supply_at_loc valve1 warehouse_loc)
    (supply_at_loc valve2 warehouse_loc)
    (supply_at_loc valve3 warehouse_loc)
    (supply_at_loc bolt1 warehouse_loc)
    (supply_at_loc bolt2 warehouse_loc)
    (supply_at_loc bolt3 warehouse_loc)
    (supply_at_loc tool1 warehouse_loc)
    (supply_at_loc tool2 warehouse_loc)
    (supply_at_loc tool3 warehouse_loc)
    ;; supplies availabity
    (supply_available valve1)
    (supply_available valve2)
    (supply_available valve3)
    (supply_available bolt1)
    (supply_available bolt2)
    (supply_available bolt3)
    (supply_available tool1)
    (supply_available tool2)
    (supply_available tool3)
  )

  (:goal (and
    (robot_at_loc cargo warehouse_loc)
    (has_valve workstation1)
    (has_valve workstation3)
    (has_valve workstation4)
    (has_bolt workstation2)
    (has_bolt workstation3)
    (has_bolt workstation4)
    (has_tool workstation2)
    (has_tool workstation3)
    (has_tool workstation4)
  ))
)

; plan
1. (load_robot cargo box3 warehouse_loc)
   deleted: (robot_unloaded cargo) (box_at_loc box3 warehouse_loc)
   added: (robot_loaded cargo) (box_on_robot box3 cargo)
   goals met: 1 of 10
2. (move_box cargo box3 warehouse_loc location1)
   deleted: (robot_at_loc cargo warehouse_loc)
   added: (robot_at_loc cargo location1) (box_at_loc box3 location1)
   goals met: 0 of 10
3. (move_box cargo box3 location1 warehouse_loc)
   deleted: (robot_at_loc cargo location1) (box_at_loc box3 location1)
   added: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   goals met: 1 of 10
4. (load_supply cargo warehouse_loc box3 tool3)
   deleted: (box_empty box3) (supply_at_loc tool3 warehouse_loc)
   added: (supply_in_box tool3 box3) (box_full box3)
   goals met: 1 of 10
5. (move_box cargo box3 warehouse_loc location1)
   deleted: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   added: (robot_at_loc cargo location1) (box_at_loc box3 location1)
   goals met: 0 of 10
6. (unload_tool cargo box3 tool3 location1 workstation2)
   deleted: (box_full box3) (supply_in_box tool3 box3) (supply_available tool3)
   added: (box_empty box3) (supply_at_loc tool3 location1) (ws_contains workstation2 tool3) (has_tool workstation2)
   goals met: 1 of 10
7. (move_box cargo box3 location1 warehouse_loc)
   deleted: (robot_at_loc cargo location1) (box_at_loc box3 location1)
   added: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   goals met: 2 of 10
8. (load_supply cargo warehouse_loc box3 tool2)
   deleted: (box_empty box3) (supply_at_loc tool2 warehouse_loc)
   added: (supply_in_box tool2 box3) (box_full box3)
   goals met: 2 of 10
9. (move_box cargo box3 warehouse_loc location2)
   deleted: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   added: (robot_at_loc cargo location2) (box_at_loc box3 location2)
   goals met: 1 of 10
10. (unload_tool cargo box3 tool2 location2 workstation3)
   deleted: (box_full box3) (supply_in_box tool2 box3) (supply_available tool2)
   added: (box_empty box3) (supply_at_loc tool2 location2) (ws_contains workstation3 tool2) (has_tool workstation3)
   goals met: 2 of 10
11. (move_box cargo box3 location2 warehouse_loc)
   deleted: (robot_at_loc cargo location2) (box_at_loc box3 location2)
   added: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   goals met: 3 of 10
12. (load_supply cargo warehouse_loc box3 tool1)
   deleted: (box_empty box3) (supply_at_loc tool1 warehouse_loc)
   added: (supply_in_box tool1 box3) (box_full box3)
   goals met: 3 of 10
13. (move_box cargo box3 warehouse_loc location3)
   deleted: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   added: (robot_at_loc cargo location3) (box_at_loc box3 location3)
   goals met: 2 of 10
14. (unload_tool cargo box3 tool1 location3 workstation4)
   deleted: (box_full box3) (supply_in_box tool1 box3) (supply_available tool1)
   added: (box_empty box3) (supply_at_loc tool1 location3) (ws_contains workstation4 tool1) (has_tool workstation4)
   goals met: 3 of 10
15. (move_box cargo box3 location3 warehouse_loc)
   deleted: (robot_at_loc cargo location3) (box_at_loc box3 location3)
   added: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   goals met: 4 of 10
16. (load_supply cargo warehouse_loc box3 bolt3)
   deleted: (box_empty box3) (supply_at_loc bolt3 warehouse_loc)
   added: (supply_in_box bolt3 box3) (box_full box3)
   goals met: 4 of 10
17. (move_box cargo box3 warehouse_loc location1)
   deleted: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   added: (robot_at_loc cargo location1) (box_at_loc box3 location1)
   goals met: 3 of 10
18. (unload_bolt cargo box3 bolt3 location1 workstation2)
   deleted: (box_full box3) (supply_in_box bolt3 box3) (supply_available bolt3)
   added: (box_empty box3) (supply_at_loc bolt3 location1) (ws_contains workstation2 bolt3) (has_bolt workstation2)
   goals met: 4 of 10
19. (move_box cargo box3 location1 warehouse_loc)
   deleted: (robot_at_loc cargo location1) (box_at_loc box3 location1)
   added: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   goals met: 5 of 10
20. (load_supply cargo warehouse_loc box3 valve3)
   deleted: (box_empty box3) (supply_at_loc valve3 warehouse_loc)
   added: (supply_in_box valve3 box3) (box_full box3)
   goals met: 5 of 10
21. (move_box cargo box3 warehouse_loc location1)
   deleted: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   added: (robot_at_loc cargo location1) (box_at_loc box3 location1)
   goals met: 4 of 10
22. (unload_valve cargo box3 valve3 location1 workstation1)
   deleted: (box_full box3) (supply_in_box valve3 box3) (supply_available valve3)
   added: (box_empty box3) (supply_at_loc valve3 location1) (ws_contains workstation1 valve3) (has_valve workstation1)
   goals met: 5 of 10
23. (move_box cargo box3 location1 warehouse_loc)
   deleted: (robot_at_loc cargo location1) (box_at_loc box3 location1)
   added: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   goals met: 6 of 10
24. (load_supply cargo warehouse_loc box3 bolt2)
   deleted: (box_empty box3) (supply_at_loc bolt2 warehouse_loc)
   added: (supply_in_box bolt2 box3) (box_full box3)
   goals met: 6 of 10
25. (move_box cargo box3 warehouse_loc location2)
   deleted: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   added: (robot_at_loc cargo location2) (box_at_loc box3 location2)
   goals met: 5 of 10
26. (unload_bolt cargo box3 bolt2 location2 workstation3)
   deleted: (box_full box3) (supply_in_box bolt2 box3) (supply_available bolt2)
   added: (box_empty box3) (supply_at_loc bolt2 location2) (ws_contains workstation3 bolt2) (has_bolt workstation3)
   goals met: 6 of 10
27. (move_box cargo box3 location2 warehouse_loc)
   deleted: (robot_at_loc cargo location2) (box_at_loc box3 location2)
   added: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   goals met: 7 of 10
28. (load_supply cargo warehouse_loc box3 bolt1)
   deleted: (box_empty box3) (supply_at_loc bolt1 warehouse_loc)
   added: (supply_in_box bolt1 box3) (box_full box3)
   goals met: 7 of 10
29. (move_box cargo box3 warehouse_loc location3)
   deleted: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   added: (robot_at_loc cargo location3) (box_at_loc box3 location3)
   goals met: 6 of 10
30. (unload_bolt cargo box3 bolt1 location3 workstation4)
   deleted: (box_full box3) (supply_in_box bolt1 box3) (supply_available bolt1)
   added: (box_empty box3) (supply_at_loc bolt1 location3) (ws_contains workstation4 bolt1) (has_bolt workstation4)
   goals met: 7 of 10
31. (move_box cargo box3 location3 warehouse_loc)
   deleted: (robot_at_loc cargo location3) (box_at_loc box3 location3)
   added: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   goals met: 8 of 10
32. (load_supply cargo warehouse_loc box3 valve2)
   deleted: (box_empty box3) (supply_at_loc valve2 warehouse_loc)
   added: (supply_in_box valve2 box3) (box_full box3)
   goals met: 8 of 10
33. (move_box cargo box3 warehouse_loc location2)
   deleted: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   added: (robot_at_loc cargo location2) (box_at_loc box3 location2)
   goals met: 7 of 10
34. (unload_valve cargo box3 valve2 location2 workstation3)
   deleted: (box_full box3) (supply_in_box valve2 box3) (supply_available valve2)
   added: (box_empty box3) (supply_at_loc valve2 location2) (ws_contains workstation3 valve2) (has_valve workstation3)
   goals met: 8 of 10
35. (move_box cargo box3 location2 warehouse_loc)
   deleted: (robot_at_loc cargo location2) (box_at_loc box3 location2)
   added: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   goals met: 9 of 10
36. (load_supply cargo warehouse_loc box3 valve1)
   deleted: (box_empty box3) (supply_at_loc valve1 warehouse_loc)
   added: (supply_in_box valve1 box3) (box_full box3)
   goals met: 9 of 10
37. (move_box cargo box3 warehouse_loc location3)
   deleted: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   added: (robot_at_loc cargo location3) (box_at_loc box3 location3)
   goals met: 8 of 10
38. (unload_valve cargo box3 valve1 location3 workstation4)
   deleted: (box_full box3) (supply_in_box valve1 box3) (supply_available valve1)
   added: (box_empty box3) (supply_at_loc valve1 location3) (ws_contains workstation4 valve1) (has_valve workstation4)
   goals met: 9 of 10
39. (move_box cargo box3 location3 warehouse_loc)
   deleted: (robot_at_loc cargo location3) (box_at_loc box3 location3)
   added: (robot_at_loc cargo warehouse_loc) (box_at_loc box3 warehouse_loc)
   goals met: 10 of 10
